import random 
print('โปรแกรมเป่ายิงฉุบ')
while True:
    a = random.choice(['ค้อน', 'กรรไกร', 'กระดาษ'])
    print(f"{a}")
    print('ตัวเลือก: ค้อน กรรไกร กระดาษ')
    
    x = input("คุณเลือก: ")
    if x == a:
        print('ผลลัพธ์คือ เสมอ')
    elif a == 'ค้อน' and x == 'กรรไกร':
        print('ผลลัพธ์คือ ชนะ')
        print("----------------------------------")
    elif a == 'กรรไกร' and x == 'กระดาษ':
        print('ผลลัพธ์คือ ชนะ')
        print("----------------------------------")
    elif a == 'กระดาษ' and x == 'ค้อน':
        print('ผลลัพธ์คือ ชนะ')
        print("----------------------------------")
    else:
        print('ผลลัพธ์คือ แพ้')
    

