num = int(input("กรุณาใส่ค่าเริ่มต้น : "))  # รับค่าเริ่มต้นจากผู้ใช้ และแปลงเป็นจำนวนเต็ม เก็บไว้ในตัวแปร num
num1 = int(input("กรุณาใส่ค่าสุดท้าย : "))  # รับค่าสุดท้ายจากผู้ใช้ และแปลงเป็นจำนวนเต็ม เก็บไว้ในตัวแปร num1
sum = 0  # กำหนดตัวแปร sum เริ่มต้นที่ 0 เพื่อใช้เก็บผลรวมของตัวเลข
num2 = num  # กำหนดตัวแปร num2 ให้เท่ากับค่าเริ่มต้น เพื่อใช้ในการนับทีละ 1 ภายในลูป

while (num2 <= num1):  # เริ่มลูป while ซึ่งจะทำงานต่อเนื่องจนกว่า num2 จะมากกว่า num1
    sum += num2  # บวกค่า num2 เข้ากับ sum เพื่อสะสมผลรวม
    num2 += 1  # เพิ่มค่า num2 ทีละ 1 เพื่อไปยังตัวเลขถัดไปในช่วง

print(f"ผลรวมทั้งหมดจาก {num} ถึง {num1} = {sum}")  # แสดงผลรวมทั้งหมดจากค่าเริ่มต้นถึงค่าสุดท้าย

    
