print("โปรเเกรมหาค่าพื้นที่สี่เหลี่ยมจัตุรัส")
a = int(input("กรุณาใส่ด้าน :"))
c = a * a
print(f"ค่าพื้นที่ของ 4 เหลี่ยมจัตุรัส = {c}\n")

print("โปรแกรมหาค่าพื้นที่สี่เหลี่ยมผืนผ้า") 
width = int(input("กรุณาใส่ความกว้าง :"))
length = int(input("กรุณาใส่ความยาว :"))
rectangle = width * length
print(f"ค่าพื้นที่ของสี่เหลี่ยมผืนผ้า = {rectangle}\n")

print("โปรแกรมหาค่าพื้นที่วงกลม")
pi = 3.14159
r = float(input("กรุณาใส่รัศมีของวงกลม: "))
circle = pi * r * r
print(f"ค่าพื้นที่ของวงกลม = {circle}")